In [1]:
import pandas as pd

In [8]:
account = {
    "first_name": ["Ayush", "Ryan", "Chisato", "Isabelle"],
    "last_name": ["Adhikari", "Griffin", "Nii", "Bui"],
    "University": ["CSU", "CSU", "CSU", "DU"],
    "Major": ["CIS", "CS", "Piano", "Nutrition"]
}

In [16]:
df = pd.DataFrame(account)

In [21]:
df

  first_name last_name University      Major
0      Ayush  Adhikari        CSU        CIS
1       Ryan   Griffin        CSU         CS
2    Chisato       Nii        CSU      Piano
3   Isabelle       Bui         DU  Nutrition

In [24]:
df.set_index("first_name")

           last_name University      Major
first_name
Ayush       Adhikari        CSU        CIS
Ryan         Griffin        CSU         CS
Chisato          Nii        CSU      Piano
Isabelle         Bui         DU  Nutrition

In [25]:
df.set_index("last_name")

          first_name University      Major
last_name
Adhikari       Ayush        CSU        CIS
Griffin         Ryan        CSU         CS
Nii          Chisato        CSU      Piano
Bui         Isabelle         DU  Nutrition

In [26]:
df

  first_name last_name University      Major
0      Ayush  Adhikari        CSU        CIS
1       Ryan   Griffin        CSU         CS
2    Chisato       Nii        CSU      Piano
3   Isabelle       Bui         DU  Nutrition

In [27]:
df.set_index("first_name", inplace = True)

In [28]:
df

           last_name University      Major
first_name
Ayush       Adhikari        CSU        CIS
Ryan         Griffin        CSU         CS
Chisato          Nii        CSU      Piano
Isabelle         Bui         DU  Nutrition

In [29]:
df.index

Index(['Ayush', 'Ryan', 'Chisato', 'Isabelle'], dtype='object', name='first_name')

In [32]:
df.loc["Ayush", "last_name"]

'Adhikari'

In [33]:
df.iloc[0]

last_name     Adhikari
University         CSU
Major              CIS
Name: Ayush, dtype: object

In [34]:
df.reset_index(inplace = True)

In [35]:
df

  first_name last_name University      Major
0      Ayush  Adhikari        CSU        CIS
1       Ryan   Griffin        CSU         CS
2    Chisato       Nii        CSU      Piano
3   Isabelle       Bui         DU  Nutrition